import React from 'react';
import SvgIcon,{SvgIconProps} from '@material-ui/core/SvgIcon';

export default (props: SvgIconProps) => {
  return (
    <SvgIcon {...props} viewBox={'0 0 44.441 44.441'}>
      <defs>
        <linearGradient id="linear-gradient" x1="-0.056" y1="1.273" x2="-0.056" y2="1.489" gradientUnits="objectBoundingBox">
          <stop offset="0" stopColor="#fff"/>
          <stop offset="1" stopColor="#00e7f0"/>
        </linearGradient>
      </defs>
      <path id="路径_1217" data-name="路径 1217" d="M40.738,192H37.047a.741.741,0,1,0,0,1.481h1.469v23.7H5.925v-23.7H7.348a.741.741,0,1,0,0-1.481H3.7A3.708,3.708,0,0,0,0,195.7v19.258a3.708,3.708,0,0,0,3.7,3.7H40.738c2.319,0,3.7-1.107,3.7-2.963V196.444C44.441,194.389,42.823,192,40.738,192ZM1.481,214.961V195.7A2.222,2.222,0,0,1,3.7,193.481h.741v23.7H3.7A2.222,2.222,0,0,1,1.481,214.961Zm41.478.741c0,.367,0,1.481-2.222,1.481H40v-23.7h.741c1.144,0,2.222,1.669,2.222,2.963Z" transform="translate(0 -174.224)" fill="url(#linear-gradient)"/>
      <g id="组_1784" data-name="组 1784" transform="translate(2.222 28.146)">
        <path id="路径_1218" data-name="路径 1218" d="M24.741,304a.741.741,0,0,0-.741.741v1.481a.741.741,0,1,0,1.481,0v-1.481A.741.741,0,0,0,24.741,304Z" transform="translate(-24 -304)" fill="url(#linear-gradient)"/>
        <path id="路径_1219" data-name="路径 1219" d="M440,312.741V315.7a.741.741,0,0,0,1.481,0v-2.963a.741.741,0,0,0-1.481,0Z" transform="translate(-401.484 -311.259)" fill="url(#linear-gradient)"/>
        <path id="路径_1220" data-name="路径 1220" d="M24.741,344a.741.741,0,0,0-.741.741v.741a.741.741,0,1,0,1.481,0v-.741A.741.741,0,0,0,24.741,344Z" transform="translate(-24 -340.297)" fill="url(#linear-gradient)"/>
        <path id="路径_1221" data-name="路径 1221" d="M80,408v3.7h3.7v-1.481H81.481V408Z" transform="translate(-74.815 -398.371)" fill="url(#linear-gradient)"/>
        <path id="路径_1222" data-name="路径 1222" d="M362.222,410.222H360V411.7h3.7V408h-1.481Z" transform="translate(-328.891 -398.371)" fill="url(#linear-gradient)"/>
      </g>
      <path id="路径_1223" data-name="路径 1223" d="M96.69,35.553h25.183a.741.741,0,0,0,.741-.741V16.322a.741.741,0,1,0-1.481,0v17.75h-23.7V7.407h5.185a.741.741,0,0,0,.741-.741V1.481h17.776V2.963a.741.741,0,1,0,1.481,0V.741A.741.741,0,0,0,121.873,0H102.615c-.016,0-.03.008-.047.01a.711.711,0,0,0-.189.037c-.024.009-.048.015-.074.026a.733.733,0,0,0-.216.148L96.164,6.146a.741.741,0,0,0-.148.217c-.01.023-.016.045-.024.069a.738.738,0,0,0-.039.192c0,.016-.009.03-.009.046V34.812a.741.741,0,0,0,.741.741Zm5.185-33.024v3.4h-3.4Z" transform="translate(-87.061)" fill="url(#linear-gradient)"/>
      <g id="组_1785" data-name="组 1785" transform="translate(15.554 3.185)">
        <path id="路径_1224" data-name="路径 1224" d="M207.356,49.7c-.007.006-.009.016-.015.022a.739.739,0,0,0-.136.195l-2.618,5.761a.741.741,0,0,0,.674,1.047.73.73,0,0,0,.307-.067l5.761-2.618a.741.741,0,0,0,.2-.136c.007-.006.015-.008.021-.015l12.57-12.569,2.1-2.1a2.227,2.227,0,0,0,0-3.143l-1.048-1.047a2.276,2.276,0,0,0-3.143,0l-2.095,2.095Zm13.093-11,.524.524L209.451,50.747l-.524-.524Zm-13.7,15.792,1.359-2.99,1.63,1.63Zm4.269-2.175-.524-.524L222.02,40.273l.524.524Zm12.046-16.236a.76.76,0,0,1,1.048,0l1.047,1.047a.741.741,0,0,1,0,1.048h0l-1.572,1.571L221.5,37.654Z" transform="translate(-201.139 -34.406)" fill="url(#linear-gradient)"/>
        <path id="路径_1225" data-name="路径 1225" d="M183.554,296H168.741a.741.741,0,0,0,0,1.481h14.814a.741.741,0,1,0,0-1.481Z" transform="translate(-168 -271.78)" fill="url(#linear-gradient)"/>
      </g>
      <path id="路径_1226" data-name="路径 1226" d="M154.517,328H136.741a.741.741,0,0,0,0,1.481h17.776a.741.741,0,1,0,0-1.481Z" transform="translate(-123.408 -297.632)" fill="url(#linear-gradient)"/>
    </SvgIcon>
  )
}